Revit 2024 API
PipePressureDropData.Flow Property
 The flow of the pipe. Units: (ft³/s).
Namespace: Autodesk.Revit.DB.Plumbing
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2014
Syntax
C#
public double Flow { get; }
Visual Basic
Public ReadOnly Property Flow As Double
	Get
Visual C++
public:
property double Flow {
	double get ();
}
See Also
PipePressureDropData Class
Autodesk.Revit.DB.Plumbing Namespace